tutorials/multiRegion/CHT/VoFcoolingCylinder2D/0/fluid/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 297;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 297;
    }
    outlet
    {
        type            calculated;
        value           uniform 297;
    }
    top
    {
        type            calculated;
        value           uniform 297;
    }
    bottom
    {
        type            calculated;
        value           uniform 297;
    }
    frontAndBack
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            calculated;
        value           uniform 297;
    }
}


// ************************************************************************* //
